In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('C:/Users/Swapnil/Desktop/Python Programs/InternShala - Data Science Python/Module - 3 - Statistics/Module 3 - Datasheets/Median.csv')
df

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

In [4]:
df.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [5]:
df['Overall Marks'].var( ddof = 0)

919170.8423999996

In [6]:
df['Overall Marks'].std( ddof = 0)

958.7339789534944

# Frequency table for categorical table

To know which valeus are most frequently appeared. In below case we see most liked subjetcs among students

In [8]:
df['Subject'].value_counts()

Chemistry    36
Physics      35
English      29
Name: Subject, dtype: int64